guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-r8n16-ssd1683-4.2/esp32-s-r8n16-ssd1683-4.2.cc
    void InitializeTimers() {
        esp_timer_create_args_t battery_timer_args = {
            .callback = &BatteryTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "battery_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&battery_timer_args, &battery_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(battery_timer_, 1000 * 1000));

        esp_timer_create_args_t refresh_timer_args = {
            .callback = &RefreshTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "refresh_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&refresh_timer_args, &refresh_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(refresh_timer_, DISPLAY_REFRESH_INTERVAL_US));

        // Heartbeat timer - 10 minutes
        esp_timer_create_args_t heartbeat_timer_args = {
            .callback = &HeartbeatTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "heartbeat_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&heartbeat_timer_args, &heartbeat_timer_));
        ESP_ERROR_CHECK(esp_timer_start_periodic(heartbeat_timer_, 10ULL * 60ULL * 1000ULL * 1000ULL)); // 10 minutes

        // Live mode timer - 5 seconds (not started by default)
        esp_timer_create_args_t live_mode_timer_args = {
            .callback = &LiveModeTimerCallback,
            .arg = this,
            .dispatch_method = ESP_TIMER_TASK,
            .name = "live_mode_timer",
            .skip_unhandled_events = false,
        };
        ESP_ERROR_CHECK(esp_timer_create(&live_mode_timer_args, &live_mode_timer_));
    }

    void StartLiveModeTimer() {
        if (esp_timer_is_active(live_mode_timer_)) {
            esp_timer_stop(live_mode_timer_);
        }
        ESP_LOGI(TAG, "[LIVE MODE] Starting live mode timer (5 seconds)");
        ESP_ERROR_CHECK(esp_timer_start_periodic(live_mode_timer_, 5ULL * 1000ULL * 1000ULL)); // 5 seconds
    }

    void StopLiveModeTimer() {
        if (esp_timer_is_active(live_mode_timer_)) {
            ESP_LOGI(TAG, "[LIVE MODE] Stopping live mode timer");
            esp_timer_stop(live_mode_timer_);
        }
    }



    int ReadBatteryVoltage() {
        int adc_raw = 0;
        long long sum = 0;
        int voltage = 0;
        for (int i = 0; i < 10; i++) {
            ESP_ERROR_CHECK(adc_oneshot_read(adc1_handle_, BATTERY_ADC_CHANNEL, &adc_raw));
            sum += adc_raw;
        }
        adc_raw = sum / 10;

        if (adc_calibrated_) {
            ESP_ERROR_CHECK(adc_cali_raw_to_voltage(adc1_cali_handle_, adc_raw, &voltage));
        }

        return voltage * 3;
    }

    int CalculateBatteryPercentage(int voltage) {
        if (!adc_calibrated_ || voltage <= 0) {
            return -1;
        }

        const int min_voltage = 3000;
        const int max_voltage = 4200;

        if (voltage < min_voltage) {
            return 0;
        } else if (voltage > max_voltage) {
            return 100;
        } else {
            return (voltage - min_voltage) * 100 / (max_voltage - min_voltage);
        }
    }

    std::string GetRegistrationCode() {
        nvs_handle_t nvs_handle;
        esp_err_t err = nvs_open("storage", NVS_READONLY, &nvs_handle);
        if (err != ESP_OK) {
            return "N/A";
        }

        char reg_code[32] = {0};
        size_t len = sizeof(reg_code);
        err = nvs_get_str(nvs_handle, "registration_code", reg_code, &len);
        nvs_close(nvs_handle);

        if (err != ESP_OK) {
            return "N/A";
        }

        return std::string(reg_code);
    }

    void ShowWifiConfigScreen() {
        std::string reg_code = GetRegistrationCode();
        display_->showSetupScreen("XIAOZHI_XXXX", reg_code.c_str());
    }

public:
    Esp32SN8d16Ssd168342()
        : boot_button_(BOOT_BUTTON_GPIO, true, BOOT_BUTTON_HOLD_MS),
          ai_button_(AI_BUTTON_GPIO, false),  // AI 按钮是低电平有效
          volume_up_button_(VOLUME_UP_BUTTON_GPIO, true),
          volume_down_button_(VOLUME_DOWN_BUTTON_GPIO, true),
          last_battery_voltage_(0),
          last_battery_percentage_(-1),
          wifi_connected_(false),
          in_deep_sleep_(false),
          wakeup_fetch_done_(false),
          wakeup_start_chat_(false),
          delayed_wakeup_(false) {
        // 第一步：获取并判断唤醒原因（放在最开头，在任何其他初始化之前）
        // 使用三重检测机制：
        // 1. esp_sleep_get_wakeup_cause() - 标准API
        // 2. esp_sleep_get_ext1_wakeup_status() - EXT1唤醒源状态（备用）
        // 3. NVS存储 - 防止DTR/RTS复位清除RTC内存
        esp_sleep_wakeup_cause_t wakeup_cause = esp_sleep_get_wakeup_cause();
        const char* wakeup_name = "UNKNOWN";
        bool is_gpio_wakeup = false;
        
        switch(wakeup_cause) {
            case ESP_SLEEP_WAKEUP_UNDEFINED: wakeup_name = "UNDEFINED"; break;
            case ESP_SLEEP_WAKEUP_EXT0: wakeup_name = "EXT0"; is_gpio_wakeup = true; break;
            case ESP_SLEEP_WAKEUP_EXT1: wakeup_name = "EXT1"; is_gpio_wakeup = true; break;
            case ESP_SLEEP_WAKEUP_TIMER: wakeup_name = "TIMER"; break;
            case ESP_SLEEP_WAKEUP_GPIO: wakeup_name = "GPIO"; is_gpio_wakeup = true; break;
            case ESP_SLEEP_WAKEUP_UART: wakeup_name = "UART"; break;
            case ESP_SLEEP_WAKEUP_TOUCHPAD: wakeup_name = "TOUCHPAD"; break;
            case ESP_SLEEP_WAKEUP_ULP: wakeup_name = "ULP"; break;
            default: wakeup_name = "OTHER"; break;
        }
        ESP_LOGI(TAG, "[WAKEUP_DEBUG] Wakeup cause: %d (%s)", wakeup_cause, wakeup_name);
        ESP_LOGI(TAG, "[WAKEUP_DEBUG] AI_BUTTON_GPIO: %d", AI_BUTTON_GPIO);
        
        // 检查EXT1唤醒状态（用于确认按键唤醒，作为备用检测）
        bool ai_button_wakeup = false;
        uint32_t ext1_wakeup_status = esp_sleep_get_ext1_wakeup_status();
        ESP_LOGI(TAG, "[WAKEUP_DEBUG] EXT1 wakeup status: 0x%08X", ext1_wakeup_status);
        if (ext1_wakeup_status != 0 && (ext1_wakeup_status & (1ULL << AI_BUTTON_GPIO))) {
            ai_button_wakeup = true;
            ESP_LOGI(TAG, "[WAKEUP_DEBUG] AI button wakeup detected via EXT1");
        }
        
        // 读取当前AI按钮状态（调试用）
        int ai_button_level = gpio_get_level((gpio_num_t)AI_BUTTON_GPIO);
        ESP_LOGI(TAG, "[WAKEUP_DEBUG] Current AI button level: %d (HIGH=1, LOW=0)", ai_button_level);
        
