guixf/xiaozhi-esp32-inksight/main/boards/waveshare/esp32-s-r8n16-ssd1683-4.2/esp32-s-r8n16-ssd1683-4.2.cc
        // 检查NVS中的唤醒标志（备用方案，防止DTR/RTS复位清除RTC内存）
        bool nvs_button_wakeup = false;
        bool nvs_timer_wakeup = false;
        {
            nvs_handle_t nvs_handle;
            esp_err_t err = nvs_open(NVS_WAKEUP_NAMESPACE, NVS_READONLY, &nvs_handle);
            if (err == ESP_OK) {
                int32_t marker = WAKEUP_MARKER_INVALID;
                err = nvs_get_i32(nvs_handle, NVS_KEY_MARKER, &marker);
                if (err == ESP_OK && marker == WAKEUP_MARKER_VALID) {
                    int32_t val;
                    err = nvs_get_i32(nvs_handle, NVS_KEY_BUTTON_FLAG, &val);
                    nvs_button_wakeup = (err == ESP_OK) && (val != 0);
                    err = nvs_get_i32(nvs_handle, NVS_KEY_TIMER_FLAG, &val);
                    nvs_timer_wakeup = (err == ESP_OK) && (val != 0);
                    ESP_LOGI(TAG, "[RUNTIME] NVS wakeup flags - button:%d, timer:%d", 
                             nvs_button_wakeup, nvs_timer_wakeup);
                } else {
                    ESP_LOGI(TAG, "[RUNTIME] NVS marker invalid (0x%04X)", marker);
                }
                nvs_close(nvs_handle);
            } else {
                ESP_LOGW(TAG, "[RUNTIME] Failed to open NVS namespace: %s", esp_err_to_name(err));
            }
        }
        
        ESP_LOGI(TAG, "Initializing ESP32-S-N8D16-SSD1683-4.2 Board");

        // 第二步：根据唤醒原因执行不同分支（标准做法）
        bool is_wake_from_deep_sleep = false;
        
        if (wakeup_cause == ESP_SLEEP_WAKEUP_TIMER || nvs_timer_wakeup) {
            // 定时器唤醒（优先使用esp_sleep_get_wakeup_cause，NVS标志作为备用）
            ESP_LOGI(TAG, "[RUNTIME] Wake from deep sleep: TIMER (will not start chat)");
            is_wake_from_deep_sleep = true;
            in_deep_sleep_ = true;
            wakeup_start_chat_ = false;  // 定时器唤醒不启动对话
        } else if (is_gpio_wakeup || ai_button_wakeup || nvs_button_wakeup) {
            // 按键唤醒（GPIO/EXT0/EXT1唤醒，或EXT1状态检测到按键，或NVS标志）
            ESP_LOGI(TAG, "[RUNTIME] Wake from deep sleep: BUTTON (will start chat)");
            is_wake_from_deep_sleep = true;
            in_deep_sleep_ = true;
            wakeup_start_chat_ = true;  // 按键唤醒才启动对话
            
            // 设置延迟唤醒标志，在初始化完成后处理
            delayed_wakeup_ = true;
        } else {
            // 首次启动或其他原因
            ESP_LOGI(TAG, "[RUNTIME] First boot (or unknown wakeup cause)");
            is_wake_from_deep_sleep = false;
            in_deep_sleep_ = false;
            wakeup_start_chat_ = false;
        }
        
        InitializeI2c();
        InitializeButtons();
        InitializeTools();
        InitializeDisplay();
        InitializeBatteryAdc();
        InitializeTimers();

        UpdateBatteryStatus();

        // 设置网络事件回调
        SetNetworkEventCallback([this](NetworkEvent event, const std::string& data) {
            ESP_LOGI(TAG, "[RUNTIME] SetNetworkEventCallback called, event=%d", (int)event);
            HandleNetworkEventCallback(event, data);
        });

        // 第三步：根据唤醒原因执行不同逻辑
        bool local_wakeup_start_chat = wakeup_start_chat_;  // 保存局部变量供 lambda 使用
        if (is_wake_from_deep_sleep) {
            if (local_wakeup_start_chat) {
                // 按键唤醒：启动对话（延迟处理，等待display初始化完成）
                ESP_LOGI(TAG, "[RUNTIME] Button wakeup detected, will handle after initialization");
            } else {
                // 定时器唤醒：不启动对话，直接发送心跳和获取图片
                ESP_LOGI(TAG, "[RUNTIME] Timer wakeup, sending heartbeat and fetching image...");
                // 定时器唤醒应该跟首次启动一样的逻辑
                display_->showAiChatStatus("IDLE", "INITIALIZING...");
                
                // 定时器唤醒也需要清除NVS标志
                ClearNvsWakeupFlags();
            }
        } else {
            // 首次启动
            ESP_LOGI(TAG, "[RUNTIME] First boot, showing initial screen");
            display_->showAiChatStatus("IDLE", "INITIALIZING...");
        }
        
        // 处理延迟唤醒（按键唤醒后，等待初始化完成）
        if (delayed_wakeup_ && display_) {
            ESP_LOGI(TAG, "[RUNTIME] Processing delayed wakeup...");
            WakeFromDeepSleep();
            delayed_wakeup_ = false;
        }
        
        // 检查 WiFi 是否已连接（防止回调设置前已连接）
        ESP_LOGI(TAG, "[INKSIGHT] Scheduling CheckAndInitializeInksight...");
        Application::GetInstance().Schedule([this, is_wake_from_deep_sleep, local_wakeup_start_chat]() {
            ESP_LOGI(TAG, "[INKSIGHT] CheckAndInitializeInksight scheduled task running, is_wake=%d, start_chat=%d", 
                     is_wake_from_deep_sleep, local_wakeup_start_chat);
            // 定时器唤醒和首次启动一样，is_wake_from_deep_sleep 传 false，会发送心跳和获取图片
            CheckAndInitializeInksight(is_wake_from_deep_sleep && local_wakeup_start_chat);
        });
    }

    ~Esp32SN8d16Ssd168342() {
        esp_timer_stop(battery_timer_);
        esp_timer_delete(battery_timer_);
        esp_timer_stop(refresh_timer_);
        esp_timer_delete(refresh_timer_);

        ESP_ERROR_CHECK(adc_oneshot_del_unit(adc1_handle_));

        if (adc_calibrated_) {
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
            ESP_ERROR_CHECK(adc_cali_delete_scheme_curve_fitting(adc1_cali_handle_));
#elif ADC_CALI_SCHEME_LINE_FITTING_SUPPORTED
            ESP_ERROR_CHECK(adc_cali_delete_scheme_line_fitting(adc1_cali_handle_));
#endif
        }
    }

    virtual AudioCodec* GetAudioCodec() override {
        static Es8311AudioCodec audio_codec(
            i2c_bus_, I2C_NUM_0, AUDIO_INPUT_SAMPLE_RATE, AUDIO_OUTPUT_SAMPLE_RATE,
            AUDIO_I2S_GPIO_MCLK, AUDIO_I2S_GPIO_BCLK, AUDIO_I2S_GPIO_WS, AUDIO_I2S_GPIO_DOUT,
            AUDIO_I2S_GPIO_DIN, AUDIO_CODEC_PA_PIN, AUDIO_CODEC_ES8311_ADDR);
        return &audio_codec;
    }

    virtual Display* GetDisplay() override { return display_; }

    int GetBatteryVoltage() {
        return last_battery_voltage_;
    }
    
    bool IsWakeFromDeepSleep() override { return in_deep_sleep_; }
    bool IsWakeupFetchDone() const { return wakeup_fetch_done_; }
    
    // 检查唤醒后是否需要启动对话，并清除标志
    bool CheckAndClearWakeupStartChat() {
        bool result = wakeup_start_chat_;
        wakeup_start_chat_ = false;
        return result;
    }
    
    void FetchImageAfterWake() {
        if (!wakeup_fetch_done_) {
            wakeup_fetch_done_ = true;
            display_->FetchInksightImage();
            ESP_LOGI(TAG, "[INKSIGHT] Wake from deep sleep, image fetched after chat");
        }
    }
    
    void OnDeviceIdle() override {
        if (!wakeup_fetch_done_) {
            ESP_LOGI(TAG, "[INKSIGHT] Wake from deep sleep, fetching image after chat ended");
            display_->SetSuppressAutoImageFetch(false);  // 重新启用自动获取图片
            wakeup_fetch_done_ = true;
            display_->FetchInksightImage();
        }
    }
    
    virtual bool GetBatteryLevel(int& level, bool& charging, bool& discharging) override {
        level = last_battery_percentage_;
        charging = false;
        discharging = true;
        return true;
    }

    void EnterDeepSleep() {
        ESP_LOGI(TAG, "[RUNTIME] Entering deep sleep...");
        
        // 检查 always_active 模式
        if (display_->IsAlwaysActive()) {
            ESP_LOGI(TAG, "[RUNTIME] Always active mode is ON, skipping deep sleep");
            return;
        }
        
